{
  "arguments.ban": "\u003cidentifiant/mention du membre\u003e \u003ctemps\u003e [raison]",
  "arguments.channelMember": "\u003cjoin|remove\u003e \u003cidentifiant/mention du salon|reset|this\u003e",
  "arguments.joinRole": "\u003cidentifiant/mention du role|reset\u003e",
  "arguments.kick": "\u003cidentifiant/mention du membre\u003e [raison]",
  "arguments.mute": "\u003cidentifiant/mention du membre\u003e [raison]",
  "error.ban.notAnNumber": "Le temps à spécifier doit être un nombre.",
  "error.commands.botCantInteractTarget": "Je n\u0027ai pas la permissions de faire cela.",
  "error.commands.botHasNotPermission": "J\u0027ai besoin de la permission **%s** pour exécuter cette commande.",
  "error.commands.memberNull": "Vous devez spécifié une personne présente sur le serveur.",
  "error.commands.notOwner": "Seul le propriétaire du serveur peut configurer le serveur.",
  "error.commands.userCantInteractTarget": "Vous n\u0027avez pas la permission de ban ce membre.",
  "error.commands.userHasNotPermission": "Vous ne pouvez pas exécuter cette commande car vous n\u0027avez pas la permission **%s**.",
  "error.commands.userNull": "Vous devez spécifié une personne existante.",
  "error.channelMember.join.channelNull": "Le salon que vous voulez changer pour les messages de bienvenue n\u0027existe pas.",
  "error.channelMember.join.notConfigured": "Le salon pour les messages de bienvenue n\u0027a pas été configuré donc vous ne pouvez pas le réinitialiser.",
  "error.channelMember.join.sameAsConfigured": "Le salon que vous voulez changer pour les messages de bienvenue est le même que celui configuré actuellement.",
  "error.channelMember.leave.channelNull": "Le salon que vous voulez changer pour les messages de départs n\u0027existe pas.",
  "error.channelMember.leave.notConfigured": "Le salon pour les messages de départs n\u0027a pas été configuré donc vous ne pouvez pas le réinitialiser.",
  "error.channelMember.leave.sameAsConfigured": "Le salon que vous voulez changer pour les messages de départs est le même que celui configuré actuellement.",
  "error.joinRole.notConfigured": "Le rôle n\u0027a pas été configuré donc vous ne pouvez pas le réinitialiser.",
  "error.joinRole.roleNull": "Ce rôle n\u0027existe pas.",
  "error.joinRole.roleManaged": "Ce rôle ne peut pas être attribué à un utilisateur.",
  "error.joinRole.sameAsConfigured": "Le rôle que vous voulez changer est le même que celui configuré actuellement.",
  "error.localization.sameAsConfigured": "La langue que vous voulez changer pour le serveur est le même que celle configurée actuellement.",
  "help.ban": "Banni les membres définitivement du serveur. Le nombre à spécifier correspond aux messages qui vont être supprimés en fonction du temps.",
  "help.channelMember": "Défini le salon où les annonces des personnes qui rejoignent ou qui quittent le serveur avec son identifiant.",
  "help.commands": "Commandes de **%s** :",
  "help.contact": "Pour plus d\u0027aide, contactez",
  "help.discord": "ou rejoignez le discord",
  "help.DMBlocked": "Aucune aide ne peut vous être envoyé car vous avez bloqué vos messages privés.",
  "help.joinRole": "Défini le rôle que va avoir un utilisateur lors de son arrivée sur un serveur.",
  "help.kick": "Kick un membre du serveur, la personne pourra rejoindre après.",
  "help.localization": "Défini la langue du bot pour le serveur.",
  "help.mute": "Mute définitivement un membre avec une raison ou non. Unmute si la personne est déjà mute.",
  "category.fun": "Fun",
  "category.mod": "Staff",
  "category.infos": "Informations",
  "category.misc": "Divers",
  "category.config": "Configuration",
  "category.noCategory": "Pas de catégorie",
  "success.ban": "%s a bien été banni %s.",
  "success.channelMember.join.configured": "Le salon %s a bien été défini comme salon pour les messages de bienvenue.",
  "success.channelMember.join.reset": "Le salon %s n\u0027est plus le salon pour les messages de bienvenue.",
  "success.channelMember.leave.configured": "Le salon %s a bien été défini comme salon pour les messages de départs.",
  "success.channelMember.leave.reset": "Le salon %s n\u0027est plus le salon pour les messages de départs.",
  "success.joinRole.configured": "Le rôle %s a bien été défini.",
  "success.kick": "%s a bien été kick du serveur %s.",
  "success.localization.configured": "La nouvelle langue pour le serveur a bien été mise sur %s.",
  "success.mute": "%s a bien été muter %s.",
  "success.unban": "L\u0027utilisateur %s a bien été débanni.",
  "success.unmute": "%s a bien été démuter %s.",
  "messageHelper.sendError": "Une erreur est survenue. Veuillez contacter les développeurs et envoyez ce message :\n",
  "messageHelper.syntaxError.syntax": "Syntaxe de la commande ",
  "messageHelper.syntaxError.example": "Par exemple : `",
  "syntax.ban": "La limite du temps à spécifier est à 7 jours.\nSi le temps spécifié dépasse les 7 jours, celui-ci sera redéfini à 7 jours.\nLe messages seront supprimés en fonction du temps spécifié.\nMettre une raison n\u0027est pas obligatoire.",
  "syntax.channelMember": "Les arguments disponibles sont **join** et **remove** :\n- **join** définira le salon où les annonces de bienvenues apparaîtront.\n- **leave** définira le salon où les annonces de départs apparaîtront.\n\nAprès ces arguments, les arguments disponibles sont **identifiant/mention du salon**, **reset** et **this** :\n- **identifiant/mention du salon** définira le salon grâce à son indentifiant ou sa mention.\n- **reset** réinitialisera le salon qui a été configuré.\n- **this** définira le salon où a été fait la commande.",
  "syntax.joinRole": "Les arguments disponibles sont :\n- **identifiant/mention du salon** définira le rôle grâce à son indentifiant ou sa mention.\n- **reset** réinitialisera le rôle qui a été configuré.",
  "syntax.localization": "Les langues disponibles sont :\n:flag_us: / :flag_gb: en\n:flag_fr: fr\nSi la langue n\u0027est pas configurée, elle sera configurée par défaut sur la langue anglaise.",
  "syntax.mute": "Mettre une raison n\u0027est pas obligatoire.",
  "text.commands.reasonNull": "pour aucune raison",
  "text.commands.reason": "pour la raison",
  "warning.ban": ":warning: Le temps de ban a été défini à 7 jours en raison du dépassement de la limite !",
  "warning.mute": ":warning: Le rôle configuré par défaut n\u0027est pas présent donc j\u0027ai créé un nouveau rôle nommé \"Muted Role\".",
  "help.prohibit": "Ajoute ou enlève un mot dans la liste de mots interdits. Peut même réinitialiser la liste complète des mots interdits.",
  "arguments.prohibit": "\u003cadd|rem|reset\u003e \u003cmot\u003e",
  "syntax.prohibit": "Les arguments disponibles sont **add**, **rem** et **reset**.\n- **add** ajoutera un mot à la liste des mots interdits.\n- **rem** enlèvera un mot présent dans la liste des mots interdits.\n- **reset** réinitialisera la liste des mots interdits au complet.\nAprès les arguments **add** et **rem**, vous devez mettre l\u0027argument **mot** qui correspondra au mot qui va être ajouter ou enlever.",
  "error.prohibit.wordAlreadyHere": "Le mot `%s` est déjà présente dans la liste des mots interdits donc vous ne pouvez pas l\u0027ajouter dans la liste.",
  "success.prohibit.wordAdded": "Le mot `%s` a bien été ajouté à la liste des mots interdits.",
  "error.prohibit.wordNotHere": "Le mot `%s` n\u0027est pas présente dans la liste des mots interdits donc vous ne pouvez pas l\u0027enlever de la liste.",
  "success.prohibit.wordRemoved": "Le mot `%s` a bien été enlevé à la liste des mots interdits.",
  "error.prohibit.listNull": "Vous ne pouvez pas réinitialiser la liste des mots interdits car elle est déjà vide.",
  "success.prohibit.listReseted": "La liste des mots interdits de votre serveur a bien été réinitialiser."
}